var data1 = [
    {
        "名词": "IDP",
        "定义": "智能数据平台 intelligence data platform（IDP）, 包括来了数据统计、GM工具、三方游戏统计、客服、配置管理等模块",
    }
]
var data2 = [
    {
        "名词": "玩家ID（UID）",
        "定义": "wca平台用户唯一标示",
    },
    {
        "名词": "新增",
        "定义": "用户第一次登录游戏的用户",
    },
    {
        "名词": "金币",
        "定义": "通过现金购买得到的游戏货币",
    },
    {
        "名词": "兑换券",
        "定义": "通过充值返券，运营活动等送给用户的货币券，该货币券只能用于兑换话费之用",
    },
    {
        "名词": "登录",
        "定义": "注册的用户登录游戏",
    },
    {
        "名词": "充值",
        "定义": "用户通过现金购买金币的过程",
    },
    {
        "名词": "消耗",
        "定义": "用户通过金币购买的道具或者服务被使用掉的过程",
    },
    {
        "名词": "用户名",
        "定义": "用户在平台上注册的账号名称",
    },
    {
        "名词": "昵称",
        "定义": "用户在游戏服上显示的角色名称",
    },
];

var data3 = [
    {
        "名词":"今日新增用户",
        "定义":"统计时间内，今日新增用户指的是统计日内游戏服中注册的独立账号数（只注册一款游戏），按UID去重。注:统计的是通过本游戏注册的新用户数.",
    },
    {
        "名词":"今日新进用户",
        "定义":"统计时间内，今日新进用户指的是统计日内游戏服中首次注册的账号数（包括今日新增用户数及首次进入游戏的用户数），按UID去重。注:这里的所谓的“老用户数”是指其他游戏注册的用户第一次来玩本游戏的用户数。",
    },
    {
        "名词":"新用户（DNU）占比",
        "定义":"统计时间内，新增用户占比=DNU/DAU",
    },
    {
        "名词":"DOU",
        "定义":"统计时间内，DOU=DAU-DNU",
    },
    {
        "名词":"日实时在线人数",
        "定义":"统计日同时在在线人数，包括游客和正式用户。",
    },
    {
        "名词":"周实时在线人数",
        "定义":"统计月同时在在线人数，包括游客和正式用户。去重统计。",
    },
    {
        "名词":"月实时在线人数",
        "定义":"统计周同时在在线人数，包括游客和正式用户。去重统计 ",
    },
    {
        "名词":"DAU",
        "定义":"统计时间内，DAU指的是按天进行分组在统计日内已在游戏服上注册过后又登陆的用户数量，按UID去重。",
    },
    {
        "名词":"WAU",
        "定义":"统计时间内，DAU指的是按周进行分组在统计日内已在游戏服上注册过后又登陆的用户数量，按UID去重。",
    },
    {
        "名词":"MAU",
        "定义":"统计时间内，MAU指的是:按天进行分组当前统计日前30天已在游戏服上注册过后又登陆的用户数量，按UID去重。",
    },
    {
        "名词":"充值人数",
        "定义":"统计时间内，游戏服的充值用户数指的是:对统计游戏服有过充值行为的用户数量，多次充值只计算一次。",
    },
    {
        "名词":"充值金额",
        "定义":"统计时间内，游戏服上的充值金额，指的是统计游戏服，用户充值的总金额",
    },
    {
        "名词":"ARPU",
        "定义":"统计时间内，充值金额/登录用户数（DAU）",
    },
    {
        "名词":"ARPPU",
        "定义":"统计时间内，充值金额/充值人数运营类",
    },
    {
        "名词":"回归用户数 ",
        "定义":"游戏服回访用户数指的是:统计游戏服上，在统计时间7天之前登录过得在统计日又登录的用户数，按照用户名去重。",
    },
    {
        "名词":"未进行游戏的人数",
        "定义":"统计时间内，今日新增用户中进入游戏后没有游戏记录的人数。",
    },
    {
        "名词":"流失率",
        "定义":"统计时间内，未进行游戏的人数 / 今日新增用户数。",
    },
    {
        "名词":"玩游戏人数",
        "定义":"统计时间内，今日新增用户中进入游戏后有游戏记录的人数。",
    },
    {
        "名词":"转化率",
        "定义":"统计时间内，玩游戏人数 / 今日新增用户数。",
    },
    {
        "名词":"开局总数",
        "定义":"统计时间内，按天分组统计游戏服上一天中开始的游戏总局数。",
    },
    {
        "名词":"平均在线",
        "定义":"统计时间内，每次打点记录统计的用户数量相加总和/记录次数（比如:如果一款游戏每5分钟记录一次，则每小时记录12次，那么每小时的平均在线=12次的记录数量总和/12）；每款游戏的打点记录统计的时间间隔可能会有所不同。",
    },
    {
        "名词":"最高在线  ",
        "定义":"每天的峰值在线用户账号数。",
    },
    {
        "名词":"联网用户数 ",
        "定义":"统计时间内，按天分组统计游戏服上一天中上网玩游戏的用户数（非单机）。",
    },
    {
        "名词":"N日存留",
        "定义":"N日留存=（前N日所有新增用户中在统计日登陆的用户数）/前N日所有新增用户数。",
    },
    {
        "名词":"大厅插件N日存留",
        "定义":"N日留存=（前N日该插件所有新进用户中在统计日登陆插件的用户数）/前N日该插件所有新进用户数。",
    },
]

$(function () {
    $('#table1').DataTable({
        'data': data1,
        'columns': [
            { 'data': '名词', 'title': '名词' },
            { 'data': '定义', 'title': '定义' },
        ],
        paging: false,
        searching: false,
        select: false,
        info: false,
    });

    $('#table2').DataTable({
        data: data2,
        columns: [
            { 'data': '名词', 'title': '名词' },
            { 'data': '定义', 'title': '定义' },
        ],
        paging: false,
        searching: false,
        select: false,
        info: false,
    });

    $('#table3').DataTable({
        data: data3,
        columns: [
            { 'data': '名词', 'title': '名词' },
            { 'data': '定义', 'title': '定义' },
        ],
        paging: false,
        searching: false,
        select: false,
        info: false,
    });
});